In [3]:
#handalling the missing valuesAA
#1.droping cloumns
#2.droping rows
#3.various parameter in droping functionlities
#4.handling  missing value by mean median mode

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark=SparkSession.builder.appName('practice').getOrCreate()

In [6]:
df2=spark.read.csv(r'D:\Naresh_it_praksah_senapathi\sept_DL\Spark\sample2.csv',header=True,inferSchema=True)

In [7]:
df2.show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
|    jack|  31|        10| 30000|
|    alex|  30|         8| 25000|
|caroline|  29|         4| 20000|
|    paul|  24|         3| 20000|
|  sandra|  21|         1| 15000|
|casandra|  23|         2| 18000|
|     dan|null|      null| 40000|
|    null|  34|        10| 38000|
|    null|  36|      null|  null|
+--------+----+----------+------+

In [8]:
df2.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [9]:
#drop the columns
df2.drop('Name').show()

+----+----------+------+
| age|Experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 20000|
|  21|         1| 15000|
|  23|         2| 18000|
|null|      null| 40000|
|  34|        10| 38000|
|  36|      null|  null|
+----+----------+------+

In [10]:
df2.show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
|    jack|  31|        10| 30000|
|    alex|  30|         8| 25000|
|caroline|  29|         4| 20000|
|    paul|  24|         3| 20000|
|  sandra|  21|         1| 15000|
|casandra|  23|         2| 18000|
|     dan|null|      null| 40000|
|    null|  34|        10| 38000|
|    null|  36|      null|  null|
+--------+----+----------+------+

In [11]:
df2.na.drop().show()

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
|    jack| 31|        10| 30000|
|    alex| 30|         8| 25000|
|caroline| 29|         4| 20000|
|    paul| 24|         3| 20000|
|  sandra| 21|         1| 15000|
|casandra| 23|         2| 18000|
+--------+---+----------+------+

In [12]:
#any==how
df2.na.drop(how="any").show()

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
|    jack| 31|        10| 30000|
|    alex| 30|         8| 25000|
|caroline| 29|         4| 20000|
|    paul| 24|         3| 20000|
|  sandra| 21|         1| 15000|
|casandra| 23|         2| 18000|
+--------+---+----------+------+

In [13]:
#threshold
df2.na.drop(how='any',thresh=3).show()

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
|    jack| 31|        10| 30000|
|    alex| 30|         8| 25000|
|caroline| 29|         4| 20000|
|    paul| 24|         3| 20000|
|  sandra| 21|         1| 15000|
|casandra| 23|         2| 18000|
|    null| 34|        10| 38000|
+--------+---+----------+------+

In [14]:
df2.na.drop(how='any',subset=['age']).show()

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
|    jack| 31|        10| 30000|
|    alex| 30|         8| 25000|
|caroline| 29|         4| 20000|
|    paul| 24|         3| 20000|
|  sandra| 21|         1| 15000|
|casandra| 23|         2| 18000|
|    null| 34|        10| 38000|
|    null| 36|      null|  null|
+--------+---+----------+------+

In [18]:
#filling the missing value
df2.na.fill('Missing value',['age','Experience']).show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
|    jack|  31|        10| 30000|
|    alex|  30|         8| 25000|
|caroline|  29|         4| 20000|
|    paul|  24|         3| 20000|
|  sandra|  21|         1| 15000|
|casandra|  23|         2| 18000|
|     dan|null|      null| 40000|
|    null|  34|        10| 38000|
|    null|  36|      null|  null|
+--------+----+----------+------+

In [19]:
df2.show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
|    jack|  31|        10| 30000|
|    alex|  30|         8| 25000|
|caroline|  29|         4| 20000|
|    paul|  24|         3| 20000|
|  sandra|  21|         1| 15000|
|casandra|  23|         2| 18000|
|     dan|null|      null| 40000|
|    null|  34|        10| 38000|
|    null|  36|      null|  null|
+--------+----+----------+------+

In [25]:
from pyspark.ml.feature import Imputer

imputer=Imputer(inputCols=['age','Experience','Salary'],
               outputCols=["{}_imputed".format(c) for c in['age','Experience','Salary']]
               ).setStrategy("median")

In [26]:
#fit and transform dataset df2
imputer.fit(df2).transform(df2).show()

+--------+----+----------+------+-----------+------------------+--------------+
|    Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+--------+----+----------+------+-----------+------------------+--------------+
|    jack|  31|        10| 30000|         31|                10|         30000|
|    alex|  30|         8| 25000|         30|                 8|         25000|
|caroline|  29|         4| 20000|         29|                 4|         20000|
|    paul|  24|         3| 20000|         24|                 3|         20000|
|  sandra|  21|         1| 15000|         21|                 1|         15000|
|casandra|  23|         2| 18000|         23|                 2|         18000|
|     dan|null|      null| 40000|         29|                 4|         40000|
|    null|  34|        10| 38000|         34|                10|         38000|
|    null|  36|      null|  null|         36|                 4|         20000|
+--------+----+----------+------+-----------+------------------+--------------+